<a href="https://colab.research.google.com/github/nikhilbordekar/SQL-Practice/blob/main/SQL_file.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Nikhil Bordekar's Notes**

## SQL CREATE TABLE STATEMENT:

The SQL CREATE TABLE statement is used to define and create a new table in a relational database. This statement specifies the table's name and the structure of its columns. The general syntax for creating a table is as follows:

```sql
CREATE TABLE table_name (
    column1 datatype,
    column2 datatype,
    ...
    columnN datatype
);
```

Example:

Let's create a simple table named "Employees" with columns for employee information:

```sql
CREATE TABLE Employees (
    EmployeeID INT,
    FirstName VARCHAR(50),
    LastName VARCHAR(50),
    Email VARCHAR(100),
    HireDate DATE
);
```


## SQL INSERT INTO STATEMENT:

The SQL INSERT INTO statement is used to insert new records or rows into an existing table in a relational database. You specify the table where the data should be inserted and provide the values or data for each column in the table. The general syntax for the INSERT INTO statement is as follows:

```sql
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);
```
Now, let's insert a new employee into the "Employees" table:
```sql
INSERT INTO Employees (EmployeeID, FirstName, LastName, Email, HireDate)
VALUES (3, 'Alice', 'Williams', 'alice.w@email.com', '2023-03-10');
```

## ALTER TABLE STATEMENT (TO CHANGE COLUMN NAME)

To change the name of a column in an SQL table, you can use the ALTER TABLE statement with the RENAME COLUMN clause. The specific syntax can vary slightly depending on the database management system (DBMS) you are using. Below, I'll provide a general example using standard SQL syntax:

```sql
ALTER TABLE table_name
CHANGE COLUMN old_column_name new_column_name data_type;
```
Example:

Suppose you have a table named "Employees" with a column named "EmployeeLastName," and you want to change it to "EmployeeSurname." You can use the following SQL statement:

```sql
ALTER TABLE Employees
CHANGE COLUMN EmployeeLastName EmployeeSurname VARCHAR(50);

```

##`SELECT` & `WHERE`

In SQL, the SELECT and WHERE clauses are fundamental components used for filtering and selecting data from a database
```sql
SELECT first_name, last_name
FROM employees
WHERE department = 'HR' AND salary > 50000;
```
In this example, the SELECT clause specifies the columns (first_name and last_name) to be included in the result set. The WHERE clause filters the rows, ensuring that only employees in the 'HR' department with a salary greater than 50,000 are selected.

These clauses are essential for retrieving specific data from a database, enabling you to tailor your query results to your precise requirements.

## UPDATE STATEMENET (TO UPDATE VALUE IN THE COLUMN)


To change the values in a column of an SQL table, you can use the UPDATE statement. The UPDATE statement allows you to modify existing data in a table based on a specified condition. Here's the basic syntax for updating values in a column:

```sql
UPDATE table_name
SET column_name = new_value
WHERE condition;
```
Example:

Suppose you have a table named "Students" with a column "Grade," and you want to update the grade of a specific student with ID 123 to 'A'. You can use the following SQL statement:

```sql
UPDATE Students
SET Grade = 'A'
WHERE StudentID = 123;
```

## DELETE, TRUNCATE & DROP

## 1.DELETE:

Definition: The DELETE statement is **used to remove specific rows** from a table based on a specified condition. It's a data manipulation language (DML) command.

Syntax:
```sql
DELETE FROM table_name
WHERE condition;
```
Example: Suppose you have a table named "Employees," and you want to delete the employee with an ID of 101.
```sql
DELETE FROM Employees
WHERE EmployeeID = 101;
```

## 2.TRUNCATE

Definition: The TRUNCATE statement is **used to remove all the rows from a table** while keeping the table structure intact. It's also a DDL command.

Syntax:
```sql
TRUNCATE TABLE table_name;
```
Example: To remove all rows from the "Students" table while keeping the table structure, you can use:
```sql
TRUNCATE TABLE Students;
```

## 3.DROP

Definition: The DROP statement is **used to delete an entire table or database** object, including all the data, indexes, and constraints. It's a data definition language (DDL) command.

Syntax:

1. To drop a table:

```sql
DROP TABLE table_name;
```
  EXAMPLE:
```sql
DROP TABLE Employees;
```
2. To drop a database:

```sql
DROP DATABASE database_name;
```
  EXAMPLE:
```sql
DROP DATABASE KPMG;
```

## `AGGREGATE FUNCTIONS`

Here are examples of how to use `COUNT`, `SUM`, `MAX`, `GROUP BY`, and `HAVING` to aggregate data using SQL code:

Let's say we have a table named `orders` with the following columns: `order_id`, `customer_id`, `order_date`, and `total_amount`.

1. **COUNT**: To count the number of orders for each customer:

```sql
SELECT customer_id, COUNT(order_id) AS order_count
FROM orders
GROUP BY customer_id;
```

2. **SUM**: To calculate the total amount spent by each customer:

```sql
SELECT customer_id, SUM(total_amount) AS total_spent
FROM orders
GROUP BY customer_id;
```

3. **MAX**: To find the highest order amount for each customer:

```sql
SELECT customer_id, MAX(total_amount) AS max_order_amount
FROM orders
GROUP BY customer_id;
```

4. **GROUP BY**: To group the results by a specific column (e.g., `order_date`) and then aggregate:

```sql
SELECT order_date, COUNT(order_id) AS order_count, SUM(total_amount) AS total_spent
FROM orders
GROUP BY order_date;
```

5. **HAVING**: To filter the results of a grouped query based on an aggregate condition (e.g., customers who have spent more than $1,000):

```sql
SELECT customer_id, SUM(total_amount) AS total_spent
FROM orders
GROUP BY customer_id
HAVING SUM(total_amount) > 1000;
```

In this example, the `HAVING` clause filters the results to include only those customers whose total spending (`SUM(total_amount)`) is greater than $1,000.

These SQL queries demonstrate how to use aggregate functions (`COUNT`, `SUM`, `MAX`) along with `GROUP BY` and `HAVING` to analyze and summarize data in a database.

## `DISTINCT`

Let's assume we have a table named `employees` with the following columns: `employee_id`, `first_name`, `last_name`, and `department`.

1. **DISTINCT**: To retrieve a distinct list of departments:

```sql
SELECT DISTINCT department
FROM employees;
```

This query will return a list of unique department names from the `employees` table.

2. **COUNT DISTINCT**: To count the number of distinct departments:

```sql
SELECT COUNT(DISTINCT department) AS distinct_department_count
FROM employees;
```

This query will return the count of unique department names in the `employees` table.

3. **DISTINCT with Multiple Columns**: To get distinct combinations of `first_name` and `last_name`:

```sql
SELECT DISTINCT first_name, last_name
FROM employees;
```

This query will return a list of unique combinations of first names and last names from the `employees` table.

4. **COUNT DISTINCT with Multiple Columns**: To count the number of distinct employee combinations (first name and last name):

```sql
SELECT COUNT(DISTINCT first_name, last_name) AS distinct_employee_count
FROM employees;
```

This query will return the count of unique combinations of first names and last names in the `employees` table.

These SQL queries illustrate how to use `DISTINCT` to retrieve unique values or combinations and `COUNT DISTINCT` to count the number of unique values or combinations in a table. These operations are valuable for data analysis and reporting when you want to work with distinct elements within your dataset.

## `CONVERSION TO WHOLE NUMBERS:`

## `ROUND`

In SQL, the `ROUND` function is used to round a number to a specified number of decimal places. Here's an explanation and an example of how to use the `ROUND` function:

**ROUND**:

- The `ROUND` function allows you to round a number to a specified number of decimal places.

- Syntax: `ROUND(number, decimal_places)`

- `number` is the value you want to round, and `decimal_places` is the number of decimal places to round to.

- If `decimal_places` is positive, it will round to that number of decimal places. If `decimal_places` is negative, it will round to the nearest multiple of 10, 100, 1000, etc., depending on the absolute value of `decimal_places`.

**Example**:

```sql
SELECT ROUND(3.14159, 2);     -- Rounds to 2 decimal places: 3.14
SELECT ROUND(6.789, 0);       -- Rounds to the nearest whole number: 7
SELECT ROUND(12345, -2);      -- Rounds to the nearest multiple of 100: 12300
SELECT ROUND(456.789, -1);    -- Rounds to the nearest multiple of 10: 457
```

The `ROUND` function is particularly useful when you need to control the precision of numeric values in your SQL queries or reports. It allows you to specify the level of rounding you want, whether it's to a specific number of decimal places or to the nearest multiple of 10, 100, etc.

## `CEIL AND FLOOR`

In SQL, `CEIL` and `FLOOR` are mathematical functions used to round numbers to the nearest integer. Here are explanations and examples for each of these functions:

1. **CEIL (Ceiling)**:

   - The `CEIL` function, short for "ceiling," rounds a number up to the nearest integer greater than or equal to the original number. It effectively rounds up the number to the next whole number.

   - Syntax: `CEIL(number)`

   - Example:
     ```sql
     SELECT CEIL(3.2);  -- Output: 4
     SELECT CEIL(5.7);  -- Output: 6
     SELECT CEIL(-2.4); -- Output: -2
     ```

2. **FLOOR**:

   - The `FLOOR` function rounds a number down to the nearest integer less than or equal to the original number. It effectively rounds down the number to the previous whole number.

   - Syntax: `FLOOR(number)`

   - Example:
     ```sql
     SELECT FLOOR(3.2);  -- Output: 3
     SELECT FLOOR(5.7);  -- Output: 5
     SELECT FLOOR(-2.4); -- Output: -3
     ```

Both `CEIL` and `FLOOR` are commonly used when you need to round numbers to integers while ensuring that they are always rounded away from zero in the specified direction (up for `CEIL` and down for `FLOOR`). These functions are especially useful for tasks like financial calculations, where precision and rounding behavior are important.

## `LIKE & ILIKE`
**1. LIKE:**

The LIKE operator is case-sensitive, meaning it distinguishes between uppercase and lowercase characters.
It's used to match text values based on patterns using wildcard characters:
%: Matches any sequence of characters (including no characters).
_: Matches any single character.
For example, column_name LIKE 'abc%' would match values starting with 'abc', such as 'abc123' or 'abcxyz'.

**2. ILIKE:**

The ILIKE operator is case-insensitive, meaning it does not distinguish between uppercase and lowercase characters.
It's used to perform a case-insensitive pattern match.
It also uses wildcard characters % and _, just like LIKE.
For example, column_name ILIKE 'abc%' would match values starting with 'abc' regardless of case, such as 'abc123', 'ABCXYZ', or 'aBc456'.

**Examples:**

Suppose you have a table called "Products" with a "Product_Name" column, and you want to retrieve products that have names starting with "apple" (case-insensitive):

```sql
-- Using ILIKE (case-insensitive)
SELECT * FROM Products
WHERE Product_Name ILIKE 'apple%';

-- Using LIKE (case-sensitive)
SELECT * FROM Products
WHERE Product_Name LIKE 'apple%';
```

## `JOINS`

In SQL, you can use `INNER JOIN` and `OUTER JOIN`, including `LEFT JOIN`, `RIGHT JOIN`, and `FULL JOIN`, to combine data from multiple tables based on a related column. Here are explanations of when and where to use them, along with code examples:

1. **INNER JOIN**:
   - Use `INNER JOIN` when you want to retrieve only the rows that have matching values in both tables.
   - It returns the intersection of the two tables, filtering out non-matching rows.
   - Example:

   ```sql
   SELECT orders.order_id, customers.customer_name
   FROM orders
   INNER JOIN customers ON orders.customer_id = customers.customer_id;
   ```

   In this query, only orders with matching customer IDs from both the `orders` and `customers` tables are returned.

2. **LEFT JOIN (OUTER JOIN)**:
   - Use `LEFT JOIN` when you want to retrieve all rows from the left table and the matching rows from the right table. If there's no match in the right table, it returns null values.
   - It ensures that all rows from the left table are included in the result.
   - Example:

   ```sql
   SELECT customers.customer_name, orders.order_id
   FROM customers
   LEFT JOIN orders ON customers.customer_id = orders.customer_id;
   ```

   In this query, all customers are listed, and their orders are included if they have any. If a customer has no orders, null values will be shown for the `order_id`.

3. **RIGHT JOIN (OUTER JOIN)**:
   - Use `RIGHT JOIN` when you want to retrieve all rows from the right table and the matching rows from the left table. If there's no match in the left table, it returns null values.
   - It ensures that all rows from the right table are included in the result.
   - Example:

   ```sql
   SELECT customers.customer_name, orders.order_id
   FROM customers
   RIGHT JOIN orders ON customers.customer_id = orders.customer_id;
   ```

   In this query, all orders are listed, and the corresponding customer names are included if they exist. If there's no matching customer, null values will be shown for the `customer_name`.

4. **FULL JOIN (OUTER JOIN)**:
   - Use `FULL JOIN` when you want to retrieve all rows from both tables, with null values in places where there are no matches.
   - It returns the union of the two tables, ensuring that all rows from both tables are included.
   - Example:

   ```sql
   SELECT customers.customer_name, orders.order_id
   FROM customers
   FULL JOIN orders ON customers.customer_id = orders.customer_id;
   ```

   In this query, all customers and all orders are listed, with null values in places where there are no matches.

The choice between `INNER JOIN` and `OUTER JOIN` depends on your specific requirements. Use `INNER JOIN` when you want only matching rows, and use `OUTER JOIN` (e.g., `LEFT JOIN`, `RIGHT JOIN`, or `FULL JOIN`) when you want to include non-matching rows with null values.

## `SELF JOINS`

A self-join is a type of SQL join where a table is joined with itself. This is often used when you have a table with a hierarchical or recursive structure, such as an employee table where employees have managers, or a category table where categories have parent categories. Self-joins allow you to connect rows within the same table. Let's explore self-joins with code examples.

**Example 1: Employee Hierarchy**

Suppose you have an employee table with columns: `employee_id`, `employee_name`, and `manager_id`, where `manager_id` is a foreign key referring to the `employee_id` of the manager.

```sql
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    employee_name VARCHAR(50),
    manager_id INT
);

INSERT INTO employees (employee_id, employee_name, manager_id)
VALUES
    (1, 'Alice', NULL),   -- Alice is the CEO (no manager)
    (2, 'Bob', 1),        -- Bob reports to Alice
    (3, 'Charlie', 2),    -- Charlie reports to Bob
    (4, 'David', 2);      -- David also reports to Bob
```

Now, let's say you want to retrieve a list of employees along with their managers' names. You can use a self-join for this:

```sql
SELECT e.employee_name, m.employee_name AS manager_name
FROM employees e
LEFT JOIN employees m ON e.manager_id = m.employee_id;
```

In this query, the table is joined with itself. It matches the `manager_id` of each employee with the `employee_id` of their manager. The result set includes the names of employees along with the names of their managers.

**Example 2: Category Hierarchy**

Suppose you have a category table with columns: `category_id`, `category_name`, and `parent_category_id`, where `parent_category_id` is a foreign key referring to the `category_id` of the parent category.

```sql
CREATE TABLE categories (
    category_id INT PRIMARY KEY,
    category_name VARCHAR(50),
    parent_category_id INT
);

INSERT INTO categories (category_id, category_name, parent_category_id)
VALUES
    (1, 'Electronics', NULL),
    (2, 'Smartphones', 1),
    (3, 'Laptops', 1),
    (4, 'iPhone', 2),
    (5, 'Samsung', 2),
    (6, 'Dell', 3);
```

Now, let's say you want to retrieve a hierarchical list of categories, showing each category along with its parent category. You can use a self-join:

```sql
SELECT c.category_name, p.category_name AS parent_category_name
FROM categories c
LEFT JOIN categories p ON c.parent_category_id = p.category_id;
```

In this query, the `categories` table is joined with itself based on the `parent_category_id`, allowing you to build a hierarchical structure of categories and their parent categories.

Self-joins are versatile and are commonly used in scenarios involving hierarchical or recursive data structures, such as organizational charts, bill of materials, and category hierarchies.

## `NATURAL JOIN:`

- A `NATURAL JOIN` is a type of SQL join that automatically matches columns with the same name in two or more tables.
- It is often used to combine tables with similar structures, simplifying the join operation by avoiding the need to explicitly specify the columns to join on.
- If there are multiple columns with the same name, a natural join creates a match for each common column, effectively combining them using the `AND` operator.
- Natural joins can be risky because they rely on column names, and changes in the table structure or accidental column name duplication can lead to unintended results.
- This type of join is less commonly used compared to other types of joins, as it requires precise column name matching to work effectively.

**Example of NATURAL JOIN**:

Suppose you have two tables, `employees` and `departments`, and both have a common column named `department_id`. A natural join between these tables would automatically match rows based on the common column, like this:

```sql
SELECT * FROM employees
NATURAL JOIN departments;
```

## `CROSS JOIN:`

- A `CROSS JOIN`, also known as a Cartesian join, is a type of join that combines each row from the first table with every row from the second table, resulting in a Cartesian product.
- It does not require any specific condition or matching of columns; instead, it creates a complete combination of all rows from both tables.
- Cross joins can lead to a large number of rows in the result set, especially when both tables have many rows, so they should be used with caution.
- They are often used when you want to generate all possible combinations of data, such as for generating test data, but are rarely used in typical database queries.

**Example of CROSS JOIN**:

Suppose you have two tables, `products` and `customers`. A cross join between these tables would generate a result that includes every combination of product and customer, like this:

```sql
SELECT * FROM products
CROSS JOIN customers;
```

It's essential to be cautious with cross joins, especially when working with tables that contain a large number of rows, as they can lead to an extensive and potentially unmanageable result set.

## `STRING` & `TIME CONVERSIONS`

In SQL, you can perform string and time conversions using various functions depending on the database system you are using. Below are some common SQL operations for string and time conversions with code examples:

**String Conversions:**

1. **CAST/CONVERT**: To convert a non-string data type (e.g., date, number) into a string:

   ```sql
   -- Using CAST
   SELECT CAST(some_integer AS VARCHAR) AS string_column
   FROM your_table;

   -- Using CONVERT (SQL Server)
   SELECT CONVERT(VARCHAR, some_date, 120) AS string_date
   FROM your_table;
   ```

2. **CONCATENATION**: To concatenate strings together:

   ```sql
   -- Using CONCAT
   SELECT CONCAT(first_name, ' ', last_name) AS full_name
   FROM employees;
   ```

3. **SUBSTRING**: To extract part of a string:

   ```sql
   SELECT SUBSTRING(column_name, start_position, length) AS extracted_string
   FROM your_table;
   ```

**Time Conversions:**

1. **TO_DATE/TO_TIMESTAMP (Database-dependent)**: To convert a string to a date or timestamp:

   ```sql
   -- PostgreSQL
   SELECT TO_DATE('2023-08-22', 'YYYY-MM-DD') AS date_column
   FROM your_table;

   -- Oracle
   SELECT TO_DATE('2023-08-22', 'YYYY-MM-DD') AS date_column
   FROM your_table;

   -- SQL Server
   SELECT CONVERT(DATETIME, '2023-08-22', 120) AS date_column
   FROM your_table;
   ```

2. **DATE_FORMAT/TO_CHAR (Database-dependent)**: To format a date or timestamp as a string:

   ```sql
   -- MySQL
   SELECT DATE_FORMAT(some_date, '%Y-%m-%d') AS formatted_date
   FROM your_table;

   -- PostgreSQL
   SELECT TO_CHAR(some_date, 'YYYY-MM-DD') AS formatted_date
   FROM your_table;

   -- Oracle
   SELECT TO_CHAR(some_date, 'YYYY-MM-DD') AS formatted_date
   FROM your_table;

   -- SQL Server
   SELECT CONVERT(VARCHAR, some_date, 120) AS formatted_date
   FROM your_table;
   ```

These examples demonstrate how to perform common string and time conversions in SQL. The specific functions and syntax may vary depending on the database system you are using, so make sure to refer to your database's documentation for exact details.

## `UNION`

In SQL, both `UNION` and `UNION ALL` are used to combine the results of two or more `SELECT` queries into a single result set. However, there is a key difference between them:

- `UNION`: Removes duplicate rows from the result set, ensuring that only distinct rows are included in the final result.
- `UNION ALL`: Includes all rows from the result sets, including duplicates. It does not remove duplicate rows.

Here are code examples illustrating the use of both `UNION` and `UNION ALL`:

Assume we have two tables: `customers` and `vendors`, and we want to retrieve a list of unique names from both tables.

**Using UNION (Removing Duplicates):**

```sql
-- Retrieve unique customer names and vendor names
SELECT customer_name
FROM customers
UNION
SELECT vendor_name
FROM vendors;
```

In this example, the `UNION` operator combines the results of the two `SELECT` statements and removes duplicate names, so the result will contain only distinct names.

**Using UNION ALL (Including Duplicates):**

```sql
-- Retrieve all customer names and vendor names, including duplicates
SELECT customer_name
FROM customers
UNION ALL
SELECT vendor_name
FROM vendors;
```

In this example, we use `UNION ALL`, which combines the results of the two `SELECT` statements without removing duplicates. So, if there are duplicate names between customers and vendors, they will be included multiple times in the result.

Choose between `UNION` and `UNION ALL` based on your specific requirements. Use `UNION` when you want to retrieve distinct values and `UNION ALL` when you want to include all values, including duplicates, in the final result set.

## `HANDLING NULL VALUES`

Handling NULL values creatively in SQL often involves using functions like `COALESCE`, `CASE`, or `IS NULL` conditions. Here are some code examples to demonstrate creative ways of dealing with NULLs:

**Using COALESCE:**

Suppose you have a table `employees` with columns `first_name`, `last_name`, and `middle_name`, and some employees have a middle name while others do not. You want to display their full names creatively by handling NULL middle names:

```sql
SELECT
    first_name || ' ' || COALESCE(middle_name, '') || ' ' || last_name AS full_name
FROM
    employees;
```

In this example, `COALESCE` is used to replace NULL middle names with an empty string to ensure that the full name is displayed correctly for all employees.

**Using CASE:**

Suppose you have a table `orders` with columns `order_id`, `order_date`, and `ship_date`, and you want to categorize orders as either "On Time" or "Delayed" based on whether the `ship_date` is NULL or not:

```sql
SELECT
    order_id,
    order_date,
    ship_date,
    CASE
        WHEN ship_date IS NULL THEN 'Delayed'
        ELSE 'On Time'
    END AS order_status
FROM
    orders;
```

In this example, a `CASE` statement is used to creatively determine the order status based on the presence or absence of a `ship_date`.

**Using IS NULL:**

Suppose you have a table `inventory` with columns `product_id`, `product_name`, and `expiry_date`, and you want to identify products that have expired or those with no expiry date:

```sql
SELECT
    product_id,
    product_name,
    expiry_date,
    CASE
        WHEN expiry_date IS NULL THEN 'No Expiry Date'
        WHEN expiry_date < CURRENT_DATE THEN 'Expired'
        ELSE 'Not Expired'
    END AS expiry_status
FROM
    inventory;
```

In this example, the `IS NULL` condition is creatively used to identify products with no expiry date, and a `CASE` statement is used to determine whether a product is expired or not based on the expiry date.

These examples demonstrate creative ways to handle NULL values in SQL using functions like `COALESCE`, `CASE`, and `IS NULL`, allowing you to produce meaningful and informative query results.

## `SUBQUERIES`

Subqueries, also known as nested queries or subselects, are SQL queries that are embedded within other SQL queries. They can be used in various ways to retrieve data and perform operations. However, the impact of subqueries on the efficiency of a query can vary depending on how they are used. Let's explore subqueries and their impact on query efficiency with code examples.

**Using Subqueries Efficiently:**

Subqueries can help improve query efficiency by breaking down complex tasks into smaller, manageable parts. For example, you can use a subquery to retrieve a specific value that you then use in the main query. Here's an example:

Suppose you have a table `orders` and a table `customers`. You want to retrieve orders made by customers with a specific last name. You can use a subquery to first find the customer IDs with the desired last name and then use that result in the main query:

```sql
-- Subquery to retrieve customer IDs with the last name 'Smith'
SELECT customer_id
FROM customers
WHERE last_name = 'Smith';

-- Main query to retrieve orders made by those customers
SELECT order_id, order_date
FROM orders
WHERE customer_id IN (SELECT customer_id FROM customers WHERE last_name = 'Smith');
```

In this case, the subquery filters customers efficiently, and the main query retrieves orders made by those specific customers. This approach can enhance query readability and maintainability.

**Impact of Inefficient Subqueries:**

On the other hand, poorly designed or inefficient subqueries can negatively impact query performance. For instance, using a subquery that retrieves data for each row in a result set can be inefficient. Consider this example:

Suppose you have a table `employees` and you want to find employees whose salary is higher than the average salary of all employees. Using a subquery to calculate the average salary for each row can lead to poor performance:

```sql
-- Inefficient subquery
SELECT employee_id, first_name, last_name, salary
FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees);
```

In this case, the subquery is executed for each row in the `employees` table, which can be resource-intensive for large datasets. A more efficient approach would be to calculate the average salary once and then use it in the main query.

**Using Efficient Subqueries:**

Here's a more efficient way to achieve the same result:

```sql
-- Efficient query with a common table expression (CTE)
WITH avg_salary_cte AS (
    SELECT AVG(salary) AS avg_salary
    FROM employees
)
SELECT employee_id, first_name, last_name, salary
FROM employees
WHERE salary > (SELECT avg_salary FROM avg_salary_cte);
```

In this example, a common table expression (CTE) is used to calculate the average salary only once, and that result is then used in the main query. This approach is more efficient as it avoids redundant calculations.

In summary, subqueries can impact query efficiency positively when used wisely to break down complex tasks, but they can also lead to performance issues if used inefficiently. Understanding when and how to use subqueries effectively is essential for optimizing SQL queries.

## `TEMPORARY TABLES`

Temporary tables in SQL are tables that exist only for the duration of a database session or until explicitly dropped. They are useful for storing intermediate results or temporary data that you don't want to persist permanently in the database. Temporary tables are often used in complex queries, data transformations, and reporting. Below, I'll explain temporary tables using coding examples.

**Creating Temporary Tables:**

Temporary tables can be created using `CREATE TEMPORARY TABLE` or `CREATE TEMP TABLE` statements, depending on the database system you are using.

Here's an example of creating a temporary table in SQL:

```sql
-- Creating a temporary table named 'temp_orders'
CREATE TEMPORARY TABLE temp_orders (
    order_id INT,
    order_date DATE,
    total_amount DECIMAL(10, 2)
);
```

This creates a temporary table named `temp_orders` with columns for order ID, order date, and total amount.

**Inserting Data into Temporary Tables:**

You can insert data into temporary tables just like regular tables using `INSERT INTO` statements. For example:

```sql
-- Inserting data into the temporary table
INSERT INTO temp_orders (order_id, order_date, total_amount)
VALUES
    (1, '2023-08-22', 100.50),
    (2, '2023-08-23', 75.20),
    (3, '2023-08-23', 150.75);
```

This inserts three rows of data into the `temp_orders` temporary table.

**Querying Temporary Tables:**

You can perform queries on temporary tables just like regular tables. Here's an example of retrieving data from the temporary table:

```sql
-- Retrieving data from the temporary table
SELECT *
FROM temp_orders;
```

This query retrieves all rows from the `temp_orders` temporary table.

**Dropping Temporary Tables:**

Temporary tables are automatically dropped when the database session ends, but you can also explicitly drop them using the `DROP TEMPORARY TABLE` statement:

```sql
-- Dropping the temporary table
DROP TEMPORARY TABLE temp_orders;
```

This removes the `temp_orders` temporary table from the database.

Temporary tables are a valuable tool for managing and manipulating data within a specific session without the need for permanent storage. They are particularly useful for complex queries and data transformations.

## `COMMON TABLE EXPRESSIONS (CTE)`

Common Table Expressions (CTEs) are temporary result sets that can be referenced within a SELECT, INSERT, UPDATE, or DELETE statement. CTEs are often used to simplify complex queries and make SQL code more readable. Below are examples of how to use CTEs in SQL.

**Example 1: Basic CTE**

Suppose you have a table named `employees` with columns `employee_id`, `first_name`, `last_name`, and you want to retrieve a list of employees' full names.

```sql
-- Using a CTE to concatenate employee names
WITH EmployeeNames AS (
    SELECT
        employee_id,
        CONCAT(first_name, ' ', last_name) AS full_name
    FROM employees
)
SELECT * FROM EmployeeNames;
```

In this example, we create a CTE named `EmployeeNames` that concatenates `first_name` and `last_name` columns to form `full_name`. Then, we select all rows from the CTE.

**Example 2: Recursive CTE**

Recursive CTEs are used for querying hierarchical data, like organizational charts or category hierarchies. Suppose you have a table `categories` with columns `category_id`, `category_name`, and `parent_category_id`, representing a category hierarchy.

```sql
-- Using a recursive CTE to list categories and subcategories
WITH RecursiveCategory AS (
    SELECT category_id, category_name, parent_category_id
    FROM categories
    WHERE parent_category_id IS NULL -- Anchor member (top-level categories)
    
    UNION ALL
    
    SELECT c.category_id, c.category_name, c.parent_category_id
    FROM categories c
    INNER JOIN RecursiveCategory rc ON c.parent_category_id = rc.category_id -- Recursive member (subcategories)
)
SELECT * FROM RecursiveCategory;
```

In this example, we use a recursive CTE to retrieve a list of categories and subcategories. The anchor member selects top-level categories (where `parent_category_id` is NULL), and the recursive member joins the CTE with the table to fetch subcategories.

CTEs are a powerful SQL feature that can make complex queries more understandable and maintainable. They allow you to break down a query into logical components, making it easier to work with and optimize your SQL code.

## `WINDOW FUNCTION`

Window functions are powerful SQL functions that allow you to perform calculations across a set of table rows related to the current row. Common window functions include `PARTITION BY`, `LEAD`, `LAG`, and `NTILE`. Below, I'll explain these functions with code examples.

**1. PARTITION BY:**

`PARTITION BY` is used to divide the result set into partitions or groups, and then the window function is applied to each partition separately.

Suppose you have a table `sales` with columns `salesperson_id`, `order_date`, and `sales_amount`. You want to calculate the total sales amount for each salesperson.

```sql
SELECT
    salesperson_id,
    order_date,
    sales_amount,
    SUM(sales_amount) OVER (PARTITION BY salesperson_id) AS total_sales_by_salesperson
FROM sales;
```

In this query, `PARTITION BY salesperson_id` divides the data into partitions based on the `salesperson_id`. The `SUM()` function then calculates the total sales amount for each salesperson within their partition.

**2. LEAD and LAG:**

`LEAD` and `LAG` functions allow you to access data from the next or previous row within the same partition.

Suppose you have a table `stock_prices` with columns `stock_symbol`, `price`, and `date`. You want to calculate the price difference between the current day and the next day for each stock symbol.

```sql
SELECT
    stock_symbol,
    date,
    price,
    LEAD(price) OVER (PARTITION BY stock_symbol ORDER BY date) - price AS price_difference
FROM stock_prices;
```

In this query, `LEAD(price)` fetches the price of the next day, and `price - LEAD(price)` calculates the price difference.

**3. NTILE:**

`NTILE` is used to divide the result set into "n" roughly equal parts, assigning a rank or group number to each row.

Suppose you have a table `students` with columns `student_name` and `score`. You want to assign quartiles (four groups) to the students based on their scores.

```sql
SELECT
    student_name,
    score,
    NTILE(4) OVER (ORDER BY score) AS quartile
FROM students;
```

In this query, `NTILE(4)` divides the data into four groups based on the `score` column, assigning each row to one of the quartiles.

Window functions like `PARTITION BY`, `LEAD`, `LAG`, and `NTILE` are valuable tools for performing complex calculations and analysis within SQL queries. They allow you to work with data in a flexible and insightful way.

Here are some key points about window functions and examples:

1. **Aggregate Functions**:
   - Window functions can be used as aggregate functions when combined with the `OVER()` clause. They allow you to calculate values like the sum, average, maximum, or minimum across a window of rows.

   **Example - Calculate the average salary for each department:**
   ```sql
   SELECT department, AVG(salary) OVER (PARTITION BY department) as avg_salary
   FROM employees;
   ```

2. **ROW_NUMBER**:
   - `ROW_NUMBER` assigns a unique integer to each row within the result set based on the specified ordering.

   **Example - Assign row numbers to employees based on their salary in descending order:**
   ```sql
   SELECT employee_name, salary, ROW_NUMBER() OVER (ORDER BY salary DESC) as row_num
   FROM employees;
   ```

3. **RANK**:
   - `RANK` assigns a unique integer to each row within the result set based on the specified ordering, with the same rank given to rows with equal values.

   **Example - Rank employees based on their salary in descending order:**
   ```sql
   SELECT employee_name, salary, RANK() OVER (ORDER BY salary DESC) as rank
   FROM employees;
   ```

4. **DENSE_RANK**:
   - `DENSE_RANK` assigns a unique integer to each row within the result set based on the specified ordering, with the same rank given to rows with equal values, but without gaps between ranks.

   **Example - Dense rank employees based on their salary in descending order:**
   ```sql
   SELECT employee_name, salary, DENSE_RANK() OVER (ORDER BY salary DESC) as dense_rank
   FROM employees;


Window functions allow for powerful analytical capabilities in SQL, making it possible to perform calculations over a specific subset of rows while maintaining the integrity of the original result set. The `PARTITION BY` clause is particularly useful when you want to perform calculations within distinct groups or categories in your data.

## `USER DEFINED FUNCTIONS (UDFs)`

User-Defined Functions (UDFs) allow you to create custom functions in SQL to perform specific tasks or calculations.

**PostgreSQL Example (PL/pgSQL):**

Let's create a UDF in PostgreSQL that calculates the area of a rectangle using its length and width:

```sql
-- Create a function named 'calculate_rectangle_area' that takes two numeric parameters and returns a numeric value.
CREATE OR REPLACE FUNCTION calculate_rectangle_area(length numeric, width numeric) RETURNS numeric AS $$
BEGIN
    RETURN length * width;
END;
$$ LANGUAGE plpgsql;

-- Use the UDF to calculate the area of a rectangle.
SELECT calculate_rectangle_area(5.5, 3.2); -- Output: 17.6
```

In this PostgreSQL example, we create a UDF named `calculate_rectangle_area` that takes two numeric parameters (`length` and `width`) and returns the calculated area.

**MySQL Example:**

Let's create a UDF in MySQL that calculates the cube of a number:

```sql
-- Create a function named 'calculate_cube' that takes a numeric parameter and returns a numeric value.
DELIMITER //
CREATE FUNCTION calculate_cube(number numeric) RETURNS numeric
BEGIN
    RETURN number * number * number;
END;
//
DELIMITER ;

-- Use the UDF to calculate the cube of a number.
SELECT calculate_cube(4.2); -- Output: 74.088
```

In this MySQL example, we create a UDF named `calculate_cube` that takes a numeric parameter and returns the cube of that number.

**SQL Server Example (T-SQL):**

Let's create a UDF in SQL Server (T-SQL) that converts a string to uppercase:

```sql
-- Create a function named 'convert_to_uppercase' that takes a varchar parameter and returns a varchar.
CREATE FUNCTION convert_to_uppercase(@input varchar(100)) RETURNS varchar(100)
AS
BEGIN
    RETURN UPPER(@input);
END;

-- Use the UDF to convert a string to uppercase.
SELECT convert_to_uppercase('Hello, World!'); -- Output: 'HELLO, WORLD!'
```

In this SQL Server (T-SQL) example, we create a UDF named `convert_to_uppercase` that takes a varchar parameter and returns the input string converted to uppercase.

These examples demonstrate how to create UDFs in PostgreSQL, MySQL, and SQL Server. UDFs can be customized to perform a wide range of tasks and calculations to meet your specific needs in each database system.